app/views/movies/index.html.erb

<h1><%= pluralize(@movies.size, 'Movie') %></h1>
---
SELECT COUNT(*) FROM `movies` WHERE (released_on < '2014-01-15')
SELECT `movies`.* FROM `movies` WHERE (released_on < '2014-01-15') ORDER BY released_on desc