app/controllers/movies_controller.rb

  def show
    @movie = Movie.find(params[:id])
---
SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1

  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy
---
SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
DELETE FROM `movies` WHERE `movies`.`id` = 1