app/controllers/reviews_controller.rb

INSERT INTO `reviews` (`comment`, `created_at`, `movie_id`, `name`, `stars`, `updated_at`) VALUES ('Very good!', '2014-01-16 00:58:52', 4, 'Kevin', 5, '2014-01-16 00:58:52')
---
  def create
    @review = @movie.reviews.new(review_params)

    if @review.save

SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 4 LIMIT 1
---
  def set_movie
    @movie = Movie.find(params[:movie_id])